Revit 2027 API
StructuralSectionGeneralH.OuterFillet Property
 Outer Fillet - Corner fillet outer radius.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OuterFillet { get; set; }
Public Property OuterFillet As Double
	Get
	Set
public:
property double OuterFillet {
	double get ();
	void set (double value);
}
member OuterFillet : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionGeneralH Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace